W6/D3/RoutesAgain/app/controllers/artworks_controller.rb

def index
    # render plain: "I'm in the index action!"
    artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks"