W6/D3/RoutesAgain/app/controllers/users_controller.rb

  def index
    # render plain: "I'm in the index action!"
    users = User.all
---
SELECT "users".* FROM "users"

  def create
    user = User.new(params.require(:user).permit(:name, :email))
    if user.save
---
INSERT INTO "users" ("username") VALUES ($1) RETURNING "id"  [["username", "User1"]]

  def update
    user = User.find(params[:id])
    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "Ayce"], ["email", "ayce@gmail.com"], ["id", 1]]