W6/D5/lot_of_cats/app/controllers/cats_controller.rb

  def index
    @cats = Cats.all
---
SELECT "cats".* FROM "cats"